
public class Variable {

	public static void main(String[] args) {
		// 변수선언
		// int는 메모리에서 4바이트를 할당
		// int num1;
		// int num2 = 0;
		// 변수값 초기화
		// 대입연산자 "=" 오른쪽의 값을 왼쪽에 넣어라
		// num1 = 2;
		// 변수선언과 동시에 초기화
		int num1 = 20;
		// 변수의 사용
		// 정수 리터럴(소수점x) byte, char, short, int, long
		// 크기 : byte < char < short < int < long
		// 실수 리터럴(소수점o) float, double(정밀하다)
		// float < double
		// char c = 'A';
		// 코드정리 : Ctrl + Shift + F
		char c = 'A';
		int value = Integer.MAX_VALUE+1;
		
		System.out.println("MIN"+value);
		System.out.println("MAX"+Character.MAX_VALUE);
		System.out.println(num1+c);
		System.out.println((char)(c+1));
		System.out.println((char)(128));

	}

}
/*-------------------------------------------------------------------------------------- 
종류       설명              저장 공간    값의 범위 (최소값~최대값)                                        
======================================================================================   
boolean    논리값            1 bit        true / false                                      
--------------------------------------------------------------------------------------   
byte       부호 있는 정수    8 bits       -128 ~ 127                                           
--------------------------------------------------------------------------------------   
char       유니코드 문자     16 bits      \u0000 ~ \uFFFF                                      
--------------------------------------------------------------------------------------   
short      부호 있는 정수    16 bits      -32768 ~ 32767                                       
--------------------------------------------------------------------------------------   
int        부호 있는 정수    32 bits      -2147483648 ~ 2147483647                             
--------------------------------------------------------------------------------------   
long       부호 있는 정수    64 bits      -9223372036854775808 ~ 9223372036854775807           
--------------------------------------------------------------------------------------   
float      IEEE 754 실수     32 bits      1.40239846E-45f                                  
                                          ~ (표현 가능 양수 범위)                                
                                          3.40282347E+38f                                
--------------------------------------------------------------------------------------   
double     IEEE 754 실수     64 bits      4.94065645841246544E-324                         
                                          ~ (표현 가능 양수 범위)                                
                                          1.79769313486231570E+308                       
--------------------------------------------------------------------------------------*/